---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.IndexStreamLine
source: html/b7f1b029-30a5-bc9d-e371-f5933b6768da.htm
---
# IndexStreamLine Methods

Inserts a IndexLine segment into the stream and associated buffer.